import numpy as np
import random
import math as m
import time

Length = np.array([8,16,32,64,128,256,512,1024, 2048,4096])

print("Завдання 1:")
print("Для ", "8-розрядної послідовності, кількість різних ключей: ", 2**8)
print("Для ", "16-розрядної послідовності, кількість різних ключей: ", 2**16)
print("Для ", "32-розрядної послідовності, кількість різних ключей: ", 2**32)
print("Для ", "64-розрядної послідовності, кількість різних ключей: ", 2**64)
print("Для ","128-розрядної послідовності, кількість різних ключей: ", 2**128)
print("Для ", "256-розрядної послідовності, кількість різних ключей: ", 2**256)
print("Для ","512-розрядної послідовності, кількість різних ключей: ", 2**512)
print("Для ", "1024-розрядної послідовності, кількість різних ключей: ", 2**1024)
print("Для ", "2048-розрядної послідовності, кількість різних ключей: ", 2**2048)
print("Для ",  "4096-розрядної послідовності, кількість різних ключей: ", 2**4096)

temp = np.array(['0', '1', '2', '3', '4', '5', '6', '7', '8', '9', 'A', 'B','C', 'D','E', 'F'])

print("Завдання 2/3:")

Str = np.array(['', '', '', '', '', '', '', '', '', '', ''])
for j in range(Length.size):
    str = '0x'
    for i in range(m.floor(Length[j]/4)):
        x = random.randint(0, 15)
        str =str + temp[x]
    print(str)
    start = time.time()
    r = False
    ex = 0
    while (r == False):
        if str == hex(ex):
            r = True
            end = time.time()
        else:
            ex = ex + 1
    print("Час знаходження:", end - start)








